pmo-dataset/graphviz/31.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Account is set up" -> "ParallelGateway_1";
  "ParallelGateway_1" -> "Create character\nnames";
  "Check if battle.net\naccount exists" -> "Does an account\nexist?";
  "Does an account\nexist?" -> "Create battle.net\naccount" [label="No"];
  "Create battle.net\naccount" -> "Confirm registration\nvia email link";
  "Confirm registration\nvia email link" -> "ExclusiveGateway_1";
  "ParallelGateway_1" -> "Check if battle.net\naccount exists";
  "ExclusiveGateway_1" -> "Check if active WoW\nsubscription exists";
  "Check if active WoW\nsubscription exists" -> "Does a subscription\nexist?";
  "Does a subscription\nexist?" -> "Select payment\nmethod" [label="No"];
  "ParallelGateway_2" -> "Enter IBAN";
  "ParallelGateway_2" -> "Enter BIC";
  "Enter IBAN" -> "ParallelGateway_3";
  "Enter credit card\ninformation" -> "ExclusiveGateway_2";
  "ParallelGateway_3" -> "ExclusiveGateway_2";
  "Does an account\nexist?" -> "ExclusiveGateway_1" [label="Yes"];
  "Enter BIC" -> "ParallelGateway_3";
  "Select payment\nmethod" -> "Enter credit card\ninformation" [label="Credit card"];
  "ExclusiveGateway_2" -> "Log into the game";
  "Log into the game" -> "ParallelGateway_4";
  "ParallelGateway_4" -> "Select realm";
  "ParallelGateway_4" -> "Select race";
  "ParallelGateway_4" -> "Select class";
  "Select race" -> "ParallelGateway_8";
  "Select realm" -> "ParallelGateway_8";
  "Select class" -> "ParallelGateway_8";
  "ParallelGateway_8" -> "ParallelGateway_5";
  "Create character\nnames" -> "ParallelGateway_5";
  "Enter character name" -> "Name available?";
  "ParallelGateway_5" -> "ExclusiveGateway_3";
  "ExclusiveGateway_3" -> "Enter character name";
  "Name available?" -> "ExclusiveGateway_3" [label="No"];
  "Name available?" -> "ParallelGateway_6" [label="Yes"];
  "ParallelGateway_6" -> "Recieve character\nselfies";
  "ParallelGateway_6" -> "Recieve confirmation";
  "Recieve confirmation" -> "ParallelGateway_7";
  "ParallelGateway_7" -> "Character created";
  "Select payment\nmethod" -> "ParallelGateway_2" [label="Bank account"];
  "Does a subscription\nexist?" -> "ExclusiveGateway_2" [label="Yes"];
  "Recieve character\nselfies" -> "ParallelGateway_7";

  "Account is set up" [shape=circle];
  "Character created" [shape=circle, penwidth=4];
  "Does an account\nexist?" [shape=diamond];
  "ExclusiveGateway_1" [label="X", shape=diamond];
  "Does a subscription\nexist?" [shape=diamond];
  "Select payment\nmethod" [shape=diamond];
  "ExclusiveGateway_2" [label="X", shape=diamond];
  "Name available?" [shape=diamond];
  "ExclusiveGateway_3" [label="X", shape=diamond];
  "ParallelGateway_1" [label="+", shape=diamond];
  "ParallelGateway_2" [label="+", shape=diamond];
  "ParallelGateway_3" [label="+", shape=diamond];
  "ParallelGateway_4" [label="+", shape=diamond];
  "ParallelGateway_5" [label="+", shape=diamond];
  "ParallelGateway_6" [label="+", shape=diamond];
  "ParallelGateway_7" [label="+", shape=diamond];
  "ParallelGateway_8" [label="+", shape=diamond];
}
