pmo-dataset/variations/mermaid_basic/31.mmd
graph LR
	StartEvent_1(("Account is set up")) --> ParallelGateway_1{"+"}
	ParallelGateway_1 --> Task_1["Create character names"]
	Task_12["Check if battle.net account exists"] --> ExclusiveGateway_1{"Does an account exist?"}
	ExclusiveGateway_1 -->|"No"| Task_2["Create battle.net account"]
	Task_2 --> Task_3["Confirm registration via email link"]
	Task_3 --> ExclusiveGateway_2{"X"}
	ParallelGateway_1 --> Task_12
	ExclusiveGateway_2 --> Task_13["Check if active WoW subscription exists"]
	Task_13 --> ExclusiveGateway_3{"Does a subscription exist?"}
	ExclusiveGateway_3 -->|"No"| ExclusiveGateway_4{"Select payment method"}
	ParallelGateway_2{"+"} --> Task_5["Enter IBAN"]
	ParallelGateway_2 --> Task_6["Enter BIC"]
	Task_5 --> ParallelGateway_3{"+"}
	Task_4["Enter credit card information"] --> ExclusiveGateway_5{"X"}
	ParallelGateway_3 --> ExclusiveGateway_5
	ExclusiveGateway_1 -->|"Yes"| ExclusiveGateway_2
	Task_6 --> ParallelGateway_3
	ExclusiveGateway_4 -->|"Credit card"| Task_4
	ExclusiveGateway_5 --> Task_7["Log into the game"]
	Task_7 --> ParallelGateway_4{"+"}
	ParallelGateway_4 --> Task_8["Select realm"]
	ParallelGateway_4 --> Task_9["Select race"]
	ParallelGateway_4 --> Task_10["Select class"]
	Task_9 --> ParallelGateway_8{"+"}
	Task_8 --> ParallelGateway_8
	Task_10 --> ParallelGateway_8
	ParallelGateway_8 --> ParallelGateway_5{"+"}
	Task_1 --> ParallelGateway_5
	Task_11["Enter character name"] --> ExclusiveGateway_6{"Name available?"}
	ParallelGateway_5 --> ExclusiveGateway_7{"X"}
	ExclusiveGateway_7 --> Task_11
	ExclusiveGateway_6 -->|"No"| ExclusiveGateway_7
	ExclusiveGateway_6 -->|"Yes"| ParallelGateway_6{"+"}
	ParallelGateway_6 --> Task_15["Recieve character selfies"]
	ParallelGateway_6 --> Task_14["Recieve confirmation"]
	Task_14 --> ParallelGateway_7{"+"}
	ParallelGateway_7 --> EndEvent_1(("Character created"))
	ExclusiveGateway_4 -->|"Bank account"| ParallelGateway_2
	ExclusiveGateway_3 -->|"Yes"| ExclusiveGateway_5
	Task_15 --> ParallelGateway_7
